layer {
  name: "redundancy_coords"
  type: "InnerProduct"
  bottom: "sigmoid@DEPTH@"
  top: "redundancy"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 1
      sparse: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "normalized_redundancy"
  type: "Sigmoid"
  bottom: "redundancy"
  top: "normalized_redundancy"
}
layer {
  name: "_debug_redundancy"
  type: "Sigmoid"
  bottom: "redundancy"
  top: "_debug_redundancy"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "target"
  top: "target2"
  reshape_param {
    shape {
        dim: 0  # copy the dimension from below
        dim: -1 # infer it from the other dimensions
    }
  }
}
layer {
  name: "concate"
  type: "Concat"
  bottom: "target2"
  bottom: "normalized_redundancy"
  top: "_sigmoid@DEPTH_1@"
}
