name: "redundancy_ik_net_16s_100m1_4d1_1i_12k_4d2_100m2"
input: "input"
input_dim: 1 ## num
input_dim: 13 ## channel
input_dim: 1 ## w
input_dim: 1 ## h
layer {
 name: "ip5"
 type: "InnerProduct"
 bottom: "input"
 top: "ip5"
 param {
  lr_mult: 1
  decay_mult: 1
 }
 inner_product_param {
  num_output: 100
  weight_filler {
   type: "gaussian"
   std: 1
   sparse: 1
  }
  bias_filler {
   type: "constant"
   value: 0
  }
 }
}
layer {
 name: "sig5"
 type: "Sigmoid"
 bottom: "ip5"
 top: "sig6"
}
layer {
 name: "ip6"
 type: "InnerProduct"
 bottom: "sig6"
 top: "ip6"
 param {
  lr_mult: 1
  decay_mult: 1
 }
 inner_product_param {
  num_output: 100
  weight_filler {
   type: "gaussian"
   std: 1
   sparse: 1
  }
  bias_filler {
   type: "constant"
   value: 0
  }
 }
}
layer {
 name: "sig6"
 type: "Sigmoid"
 bottom: "ip6"
 top: "sig7"
}
layer {
 name: "ip7"
 type: "InnerProduct"
 bottom: "sig7"
 top: "ip7"
 param {
  lr_mult: 1
  decay_mult: 1
 }
 inner_product_param {
  num_output: 100
  weight_filler {
   type: "gaussian"
   std: 1
   sparse: 1
  }
  bias_filler {
   type: "constant"
   value: 0
  }
 }
}
layer {
 name: "sig7"
 type: "Sigmoid"
 bottom: "ip7"
 top: "sig8"
}
layer {
 name: "ip8"
 type: "InnerProduct"
 bottom: "sig8"
 top: "ip8"
 param {
  lr_mult: 1
  decay_mult: 1
 }
 inner_product_param {
  num_output: 100
  weight_filler {
   type: "gaussian"
   std: 1
   sparse: 1
  }
  bias_filler {
   type: "constant"
   value: 0
  }
 }
}
layer {
 name: "sig8"
 type: "Sigmoid"
 bottom: "ip8"
 top: "sig9"
}
layer {
 name: "output"
 type: "InnerProduct"
 bottom: "sig9"
 top: "output"
 param {
  lr_mult: 1
  decay_mult: 1
 }
 inner_product_param {
  num_output: 16
  weight_filler {
   type: "gaussian"
   std: 1
   sparse: 1
  }
  bias_filler {
   type: "constant"
   value: 0
  }
 }
}
