name: "ik_net"
layer {
  name: "input"
  type: "MemoryData"
  top: "sigmoid0"
  top: "dummy_label1"
  memory_data_param {
    batch_size: 32
    channels: 6
    height: 1
    width: 1
  }
}
layer {
  name: "target"
  type: "MemoryData"
  top: "target"
  top: "dummy_label2"
  memory_data_param {
    batch_size: 32
    channels: 6
    height: 1
    width: 1
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "output"
  bottom: "target"
  top: "loss"
}
layer {
  name: "output"
  type: "InnerProduct"
  top: "output"
  bottom: "sigmoid@DEPTH@"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "gaussian"
      std: 1
      sparse: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
