name: "ik_net"
layer {
  name: "input"
  type: "MemoryData"
  top: "sigmoid0"
  top: "dummy_label1"
  memory_data_param {
    batch_size: 32
    channels: 6
    height: 1
    width: 1
  }
}
layer {
  name: "target"
  type: "MemoryData"
  top: "target"
  top: "dummy_label2"
  memory_data_param {
    batch_size: 32
    channels: 6
    height: 1
    width: 1
  }
}
